Revit 2026 API

# TransformScaleBasis Method

---

Scales the basis vectors of this transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform ScaleBasis(
	double scale
)
```
```vb
Public Function ScaleBasis (
	scale As Double
) As Transform
```
```cpp
public:
Transform^ ScaleBasis(
	double scale
)
```
```fsharp
member ScaleBasis :
        scale : float -> Transform
```

#### Parameters

scale Double
    The scale value.

#### Return Value

TransformThe transformation equal to the composition of the two transformations.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |

The resulting transformation is equivalent to the application of the uniform scale and then this transformation, in this order.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace